Tekla Open API Reference for Tekla Structures 2025
LineSegment.Equals Method
Overload List
Name | Description
Equals(Object)
 Returns true if the objects are equal.
 (Overrides Object.Equals(Object).)
Equals(ICurve)
 Returns true if the other curve is a line segment equal to this
Top
See Also
Reference
LineSegment Class
Tekla.Structures.Geometry3d Namespace